hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/RF_LIB/inc/hw_adi_0_rf.h
// Field:     [6] CLKGENEN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL2_CLKGENEN                                 0x00000040
#define ADI_0_RF_IFADCCTL2_CLKGENEN_BITN                                     6
#define ADI_0_RF_IFADCCTL2_CLKGENEN_M                               0x00000040
#define ADI_0_RF_IFADCCTL2_CLKGENEN_S                                        6
#define ADI_0_RF_IFADCCTL2_CLKGENEN_EN                              0x00000040
#define ADI_0_RF_IFADCCTL2_CLKGENEN_DIS                             0x00000000

// Field:     [5] ADCDIGCLKEN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN                              0x00000020
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN_BITN                                  5
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN_M                            0x00000020
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN_S                                     5
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN_EN                           0x00000020
#define ADI_0_RF_IFADCCTL2_ADCDIGCLKEN_DIS                          0x00000000

// Field:     [1] INVCLKOUT
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL2_INVCLKOUT                                0x00000002
#define ADI_0_RF_IFADCCTL2_INVCLKOUT_BITN                                    1
#define ADI_0_RF_IFADCCTL2_INVCLKOUT_M                              0x00000002
#define ADI_0_RF_IFADCCTL2_INVCLKOUT_S                                       1
#define ADI_0_RF_IFADCCTL2_INVCLKOUT_EN                             0x00000002
#define ADI_0_RF_IFADCCTL2_INVCLKOUT_DIS                            0x00000000

//*****************************************************************************
//
// Register: ADI_0_RF_O_PACTL3
//
//*****************************************************************************
// Field:   [5:3] F2
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL3_F2_W                                                 3
#define ADI_0_RF_PACTL3_F2_M                                        0x00000038
#define ADI_0_RF_PACTL3_F2_S                                                 3

// Field:   [2:0] F1
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_PACTL3_F1_W                                                 3
#define ADI_0_RF_PACTL3_F1_M                                        0x00000007
#define ADI_0_RF_PACTL3_F1_S                                                 0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFALDO1
//
//*****************************************************************************
// Field:     [4] ERR_AMP_ZERO_EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN                            0x00000010
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN_BITN                                4
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN_M                          0x00000010
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN_S                                   4
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN_EN                         0x00000010
#define ADI_0_RF_IFALDO1_ERR_AMP_ZERO_EN_DIS                        0x00000000

// Field:     [3] BYPASS_REG_EN
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFALDO1_BYPASS_REG_EN                              0x00000008
#define ADI_0_RF_IFALDO1_BYPASS_REG_EN_BITN                                  3
#define ADI_0_RF_IFALDO1_BYPASS_REG_EN_M                            0x00000008
#define ADI_0_RF_IFALDO1_BYPASS_REG_EN_S                                     3

// Field:     [2] RDY_EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFALDO1_RDY_EN                                     0x00000004
#define ADI_0_RF_IFALDO1_RDY_EN_BITN                                         2
#define ADI_0_RF_IFALDO1_RDY_EN_M                                   0x00000004
#define ADI_0_RF_IFALDO1_RDY_EN_S                                            2
#define ADI_0_RF_IFALDO1_RDY_EN_EN                                  0x00000004
#define ADI_0_RF_IFALDO1_RDY_EN_DIS                                 0x00000000

// Field:     [1] BIAS_DIS
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// DIS                      Internal. Only to be used through TI provided API.
// EN                       Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFALDO1_BIAS_DIS                                   0x00000002
#define ADI_0_RF_IFALDO1_BIAS_DIS_BITN                                       1
#define ADI_0_RF_IFALDO1_BIAS_DIS_M                                 0x00000002
#define ADI_0_RF_IFALDO1_BIAS_DIS_S                                          1
#define ADI_0_RF_IFALDO1_BIAS_DIS_DIS                               0x00000002
#define ADI_0_RF_IFALDO1_BIAS_DIS_EN                                0x00000000

// Field:     [0] EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFALDO1_EN                                         0x00000001
#define ADI_0_RF_IFALDO1_EN_BITN                                             0
#define ADI_0_RF_IFALDO1_EN_M                                       0x00000001
#define ADI_0_RF_IFALDO1_EN_S                                                0
#define ADI_0_RF_IFALDO1_EN_EN                                      0x00000001
#define ADI_0_RF_IFALDO1_EN_DIS                                     0x00000000

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFALDO2
//
//*****************************************************************************
// Field:   [7:5] COMP_CAP
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFALDO2_COMP_CAP_W                                          3
#define ADI_0_RF_IFALDO2_COMP_CAP_M                                 0x000000E0
#define ADI_0_RF_IFALDO2_COMP_CAP_S                                          5

