hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/RF_LIB/inc/hw_adi_0_rf.h
// Field:   [4:0] TRIM_OUT
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFALDO2_TRIM_OUT_W                                          5
#define ADI_0_RF_IFALDO2_TRIM_OUT_M                                 0x0000001F
#define ADI_0_RF_IFALDO2_TRIM_OUT_S                                          0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFALDO3
//
//*****************************************************************************
// Field:     [4] ATEST_V_EN
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFALDO3_ATEST_V_EN                                 0x00000010
#define ADI_0_RF_IFALDO3_ATEST_V_EN_BITN                                     4
#define ADI_0_RF_IFALDO3_ATEST_V_EN_M                               0x00000010
#define ADI_0_RF_IFALDO3_ATEST_V_EN_S                                        4

// Field:     [3] ATEST_I_EN
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFALDO3_ATEST_I_EN                                 0x00000008
#define ADI_0_RF_IFALDO3_ATEST_I_EN_BITN                                     3
#define ADI_0_RF_IFALDO3_ATEST_I_EN_M                               0x00000008
#define ADI_0_RF_IFALDO3_ATEST_I_EN_S                                        3

// Field:   [2:0] COMP_RES
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFALDO3_COMP_RES_W                                          3
#define ADI_0_RF_IFALDO3_COMP_RES_M                                 0x00000007
#define ADI_0_RF_IFALDO3_COMP_RES_S                                          0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFDLDO1
//
//*****************************************************************************
// Field:     [3] BYPASS_REG_EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN                              0x00000008
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN_BITN                                  3
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN_M                            0x00000008
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN_S                                     3
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN_EN                           0x00000008
#define ADI_0_RF_IFDLDO1_BYPASS_REG_EN_DIS                          0x00000000

// Field:     [2] RDY_EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO1_RDY_EN                                     0x00000004
#define ADI_0_RF_IFDLDO1_RDY_EN_BITN                                         2
#define ADI_0_RF_IFDLDO1_RDY_EN_M                                   0x00000004
#define ADI_0_RF_IFDLDO1_RDY_EN_S                                            2
#define ADI_0_RF_IFDLDO1_RDY_EN_EN                                  0x00000004
#define ADI_0_RF_IFDLDO1_RDY_EN_DIS                                 0x00000000

// Field:     [1] BIAS_DIS
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// DIS                      Internal. Only to be used through TI provided API.
// EN                       Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO1_BIAS_DIS                                   0x00000002
#define ADI_0_RF_IFDLDO1_BIAS_DIS_BITN                                       1
#define ADI_0_RF_IFDLDO1_BIAS_DIS_M                                 0x00000002
#define ADI_0_RF_IFDLDO1_BIAS_DIS_S                                          1
#define ADI_0_RF_IFDLDO1_BIAS_DIS_DIS                               0x00000002
#define ADI_0_RF_IFDLDO1_BIAS_DIS_EN                                0x00000000

// Field:     [0] EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO1_EN                                         0x00000001
#define ADI_0_RF_IFDLDO1_EN_BITN                                             0
#define ADI_0_RF_IFDLDO1_EN_M                                       0x00000001
#define ADI_0_RF_IFDLDO1_EN_S                                                0
#define ADI_0_RF_IFDLDO1_EN_EN                                      0x00000001
#define ADI_0_RF_IFDLDO1_EN_DIS                                     0x00000000

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFDLDO2
//
//*****************************************************************************
// Field:   [7:5] COMP_CAP
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO2_COMP_CAP_W                                          3
#define ADI_0_RF_IFDLDO2_COMP_CAP_M                                 0x000000E0
#define ADI_0_RF_IFDLDO2_COMP_CAP_S                                          5

// Field:   [4:0] TRIM_OUT
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO2_TRIM_OUT_W                                          5
#define ADI_0_RF_IFDLDO2_TRIM_OUT_M                                 0x0000001F
#define ADI_0_RF_IFDLDO2_TRIM_OUT_S                                          0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFDLDO3
//
//*****************************************************************************
// Field:     [4] ATEST_V_EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO3_ATEST_V_EN                                 0x00000010
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_BITN                                     4
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_M                               0x00000010
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_S                                        4
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_EN                              0x00000010
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_DIS                             0x00000000

// Field:     [3] ATEST_I_EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO3_ATEST_I_EN                                 0x00000008
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_BITN                                     3
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_M                               0x00000008
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_S                                        3
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_EN                              0x00000008
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_DIS                             0x00000000

// Field:   [2:0] COMP_RES
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO3_COMP_RES_W                                          3
#define ADI_0_RF_IFDLDO3_COMP_RES_M                                 0x00000007
#define ADI_0_RF_IFDLDO3_COMP_RES_S                                          0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFAMPCTL3
//
//*****************************************************************************
// Field:   [7:4] AAF_CAP_EN
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFAMPCTL3_AAF_CAP_EN_W                                      4
#define ADI_0_RF_IFAMPCTL3_AAF_CAP_EN_M                             0x000000F0
#define ADI_0_RF_IFAMPCTL3_AAF_CAP_EN_S                                      4

