hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/RF_LIB/inc/hw_adi_0_rf.h
// Field:   [3:0] IB
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFAMPCTL3_IB_W                                              4
#define ADI_0_RF_IFAMPCTL3_IB_M                                     0x0000000F
#define ADI_0_RF_IFAMPCTL3_IB_S                                              0

//*****************************************************************************
//
// Register: ADI_0_RF_O_STAT
//
//*****************************************************************************
// Field:   [7:3] IFADC_CALVAL_OUT
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_STAT_IFADC_CALVAL_OUT_W                                     5
#define ADI_0_RF_STAT_IFADC_CALVAL_OUT_M                            0x000000F8
#define ADI_0_RF_STAT_IFADC_CALVAL_OUT_S                                     3

// Field:     [2] IFADC_CALDONE
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_STAT_IFADC_CALDONE                                 0x00000004
#define ADI_0_RF_STAT_IFADC_CALDONE_BITN                                     2
#define ADI_0_RF_STAT_IFADC_CALDONE_M                               0x00000004
#define ADI_0_RF_STAT_IFADC_CALDONE_S                                        2

// Field:     [1] IFLDOS_RDY
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_STAT_IFLDOS_RDY                                    0x00000002
#define ADI_0_RF_STAT_IFLDOS_RDY_BITN                                        1
#define ADI_0_RF_STAT_IFLDOS_RDY_M                                  0x00000002
#define ADI_0_RF_STAT_IFLDOS_RDY_S                                           1

// Field:     [0] RF_LDO
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_STAT_RF_LDO                                        0x00000001
#define ADI_0_RF_STAT_RF_LDO_BITN                                            0
#define ADI_0_RF_STAT_RF_LDO_M                                      0x00000001
#define ADI_0_RF_STAT_RF_LDO_S                                               0


#endif // __ADI_0_RF__
